# StairsTrisertypeNosingPlacement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTrisertypeNosingPlacement Property
ParameterTypeId Class See Also
---
"Apply Nosing Profile"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTrisertypeNosingPlacement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTrisertypeNosingPlacement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTrisertypeNosingPlacement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace